tap "koekeishiya/formulae"

# CLI tools required by scripts in scripts/bin
brew "git"
brew "openssl@3"
brew "ffmpeg"
brew "imagemagick"
brew "tesseract"
brew "pandoc"
brew "mkvtoolnix"
brew "terminal-notifier"
brew "trash"
brew "unison"
brew "go"
brew "libmagic"
brew "python"

# yabai from koekeishiya tap
brew "yabai"

# Command-line tools referenced by aliases/functions in env/.aliases
brew "colordiff"
brew "jdupes"
brew "jq"
brew "yt-dlp"
brew "gallery-dl"
brew "aspell"
brew "ripgrep-all"
brew "thefuck"
brew "watch"
brew "toilet"
brew "ghostscript"
brew "p7zip"
brew "pigz"

# GNU utilities used by aliases on macOS
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gawk"
brew "make"

# Terminal tooling referenced by tmux/zsh configs
brew "tmux"
brew "fortune"
brew "figlet"
brew "lolcat"

# GUI apps
cask "rar"
cask "hammerspoon"
cask "sublime-text"
# cask "mactex-no-gui"
cask "docker-desktop"

# Optional / may become unavailable:
# cask "filebot"